# MSup2PerKw Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MSup2PerKw Property
SymbolTypeId Class See Also
---
Symbol m²/kW, indicating unit Square meters per kilowatt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MSup2PerKw { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MSup2PerKw As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MSup2PerKw {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace